[
    {
        "title": "Art Idea Generator",
        "date": "2024-05-24",
        "content": "As an artist I often find myself staring at a blank canvas waiting for inspiration. While the unpredictability of creativity is a part of its charm, It can also be a hindrance when you're trying to create consistently or improve your skills. To overcome this I came up with the Idea to build an art idea generator that I can use to give me a prompt to get me drawing. Here is a look at how I came up with the idea, created the design and finally brought it to life with code!"
    },


    {
        "title": "Back to work!",
        "date": "2024-09-27",
        "content": "So... I was away for awhile. I got really invested in my job working to get a promotion but alas I am back and I have big things planned! I really want to work on my portfolio some more and have a mostly completed site for ReformCoaching just some final touches need to be made for its mobile versions. Then I also need to finish off kyles corner then it is onto brainstormign some new projects! In the last 4 months since my last post I have made a few things not just sitting around twiddling my thumbs, I made a drink generator for starbucks. Using JS to randomly generate a drink to try drive sales in store. I have plans to make a website for a barber but other than that I am brainstorming still! "
    },

    {

        "title": "Here we go again",
        "date": "2024-09-28",
        "content": "Another day down with some more progress made, Finished off my portfolio site with its contact section all that remains now is making sure it is mobile responsive and adding in any future projects, speaking of which I began working on a website for a dog walking company, Should not take me long to complete and then get it added onto the site. On top of that I am wanting to start looking into more backend heavy projects to begin working on perhaps something that has admin features with login etc? We shall see what comes of this however! signing off -KC"
    },

    {

        "title": "Here we go again",
        "date": "2024-09-28",
        "content": "Another day down with some more progress made, Finished off my portfolio site with its contact section all that remains now is making sure it is mobile responsive and adding in any future projects, speaking of which I began working on a website for a dog walking company, Should not take me long to complete and then get it added onto the site. On top of that I am wanting to start looking into more backend heavy projects to begin working on perhaps something that has admin features with login etc? We shall see what comes of this however! signing off -KC"
    }
]

